#5) პითონში მონაცემები იყოფა 2 ჯგუფად: ტექსტური ინფორმაცია და რიცხვები.
# ტექსტური არის str(string), ხოლო რიცხვებია int(integer)(მთელი რიცხვები) და float (ათწილადები).
# ისინი გვხვდება ბევრ დროს, მაგალითად: ცვლადების შექმნის დროს და ა. შ.

#6) /(გაყოფა) და %(ნაშთიანი გაყოფა) ორი სხვადასხვა რამ არის,
# როდესაც ვიყენებთ / ამ შემთხვევაში რიცხვები უშუალოდ იყოფა და ტერმინალში გამოაქვს განაყოფი,
#ხოლო როდესაც ვიყენებთ % ამ შემთხვევაში ტერმინალში გამოაქვს გაყოფის შედეგად დარჩენილი ნაშთი.
# მაგალითი რომ მოვიყვანო: 3/2=1.5 მაგრამ 3%2=1 მოდი დავტესტოთ პითონის დახმარებით:
print(3 / 2)
print(3 % 2)
#როგორც ჩანს ჩვენი ჰიპოთეზა გამართლდა.

#7)
print(2 + 2)
print(3 + 2)
print(11 + 6)

print(10 - 3)
print(33 - 7)
print(8 - 6)

print(3 * 3)
print(5 * 6)
print(9 * 2)

print(6 / 2)
print(9 / 3)
print(33 / 11)

print(10 % 8)
print(100 % 21)
print(21 % 10)

print(3 ** 3)
print(5 ** 9)
print(4 ** 11)

#8)
celsius = 10
fahrenheit = (celsius * 9/5) + 32
print(fahrenheit)

#9)
sister = 11
mom = 44
dad = 47
me = 16

sister2 = sister + 20
mom2 = mom + 20
dad2 = dad + 20
me2 = me + 20

print(sister2)
print(mom2)
print(dad2)
print(me2)